---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.LoopSeparationNotCompleted
source: html/3c311432-e04e-73f9-8b9f-0d50d9e27876.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.LoopSeparationNotCompleted Property

The loop separation is not completed yet. Only one side of the secondary/tertiary loop is separated. In order to correctly calculate the flow and pressure loss, please check and separate the other end of the loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId LoopSeparationNotCompleted { get; }
```